Sources/SIS/app/controllers/courses_controller.rb

  def new
    @course = Course.new
    @users = User.all
---
SELECT `users`.* FROM `users`

  def edit
    @users = User.all
---
SELECT `users`.* FROM `users`

  def create
    @course = Course.new(course_params)

    respond_to do |format|
      if @course.save
---
INSERT INTO `courses` (`course_name`, `course_number`, `created_at`, `updated_at`) VALUES ('Intro to Computer Science', 'CS101', '2017-09-04 21:10:50', '2017-09-04 21:10:50')

  def update
    respond_to do |format|
      if @course.update(course_params)
---
UPDATE `courses` SET `course_number` = 'CS102', `updated_at` = '2019-06-03 14:00:58' WHERE `courses`.`id` = 1

  def destroy
    @course.publish_to_rabbit('DELETE')
    @course.destroy
---
DELETE FROM `courses` WHERE `courses`.`id` = 4