Sources/SIS/app/controllers/users_controller.rb

  def new
    @user = User.new
    @courses = Course.all
---
SELECT `courses`.* FROM `courses`

  def edit
      @courses = Course.all
---
SELECT `courses`.* FROM `courses`

  def create
    @user = User.new(user_params)
     respond_to do |format|
      if @user.save
---
INSERT INTO `users` (`uid`, `givenname`, `surname`, `fullName`, `description`, `email`, `password`, `created_at`, `updated_at`) VALUES ('bill', 'bill', '', '', '', '', '', '2019-06-03 13:51:30', '2019-06-03 13:51:30')

  def update
    respond_to do |format|
      if @user.update(user_params)
---
UPDATE `users` SET `givenname` = 'Tommmmmm', `updated_at` = '2019-06-03 13:51:12' WHERE `users`.`id` = 1

  def destroy
    @user.publish_to_rabbit('DELETE')
    @user.destroy
---
DELETE FROM `users` WHERE `users`.`id` = 3