Sources/SIS/app/views/users/show.html.erb

SELECT `courses`.* FROM `courses` INNER JOIN `courses_users` ON `courses`.`id` = `courses_users`.`course_id` WHERE `courses_users`.`user_id` = 1
---
  <strong>Courses:</strong>
  <%= @user.courses.map {|c| c.course_name}.join(', ') %>