Sources/SIS/app/views/courses/index.html.erb

SELECT `users`.* FROM `users` INNER JOIN `courses_users` ON `users`.`id` = `courses_users`.`user_id` WHERE `courses_users`.`course_id` = 1
---
        <td><%= course.course_number %></td>
        <td><%= course.users.map {|k| k.name}.join(', ') %></td>